{
  "name": "Mega Evolution",
  "flavor": "Take yourself a step further and surpass what you once thought even possible!",
  "text": "This is a rule entry detailing how Mega Evolution works in battle. If you're looking for how to create a Mega, search for \"Mega Evolution Creation\" in the rules.\n\nMega Evolution is a technique only those strong enough can handle. To make use of a mega stone, the user must have it equipped as their held item and spend 2 will points at Initiative, swapping to their Mega stat block until they revert. Reverting happens at the end of a scene or at the player's choice during initiative.\n\nUnless stated otherwise by the GM, all of the following are rules relating to Mega Evolution.\n- Only one character in the party may Mega Evolve per quest (or spar).\n- Characters that have used Mega Evolution cannot use Z-Moves in that same quest (or spar).\n- Mega Stones are permanently equipped for the entirety of the quest (or spar) they're taken on.\n- You cannot Mega Evolve while under the effects of terastallization and must end said effect if you want to make use of a held Mega Stone. Additionally you cannot terastalize while Mega Evolved.\n\nHere is a list of a few possible questions about mega evolution and their respective answers. Not every question can possibly be thought of beforehand so of course ask the help channel if needed.\n1. Maximum HP can increase or decrease when mega evolving if Vitality or Base HP is changed. Remaining HP however follows the increases but ignores the decreases as to not make any situations where mega evolving or reverting faints the user (Increase Example: 14/18 → 16/20 | Decrease Example: 14/18 → 14/16). If your maximum HP were to fall below your remaining HP, lower remaining HP to match the maximum. (Example 2: 14/18 → 12/12)\n2. Will increases and decreases much in the same way as HP does. Remaining Will raises when the maximum raises, stays when the maximum decreases or conforms if the maximum is lower than the remaining (reference back to HP examples).\n3. Your regular active moveset and Mega active moveset is separate. This does mean you can have an entirely different set of moves upon Mega Evolving, either more or less. This does mean you must have the move list prepared beforehand just like your regular active moves list.\n4. Your ability is changed upon Mega Evolution or reverting, this means anything it was swapped to via things like Skill Swap, Entrainment or Trace will be replaced with your Mega Form's ability. This does not make you immune from subsequent Ability changes.\n5. Your typing is swapped upon Mega Evolution or reverting, similar to above this would mean any type changes or additions from things like Protean, Color Change or Nature's Curse is replaced with the Mega Form's typing. This does not make them immune from any subsequent type changes.\n6. Mega Stones cannot be forcefully unequipped, stolen or made inaccessible.",
  "example": ""
}
