{
  "name": "Mega Evolution Creation",
  "flavor": "All greater powers start somewhere.",
  "text": "This is a rule entry detailing the requirements and steps needed to get yourself a mega evolution. If you're looking for rules pertaining to Mega Evolution in battle, check for the rule entry \"Mega Evolution\".\n\nMega crystals are a rare commodity for pokemon, only bolstered by the fact that each one is almost uniquely bonded to its user. Once a character reaches level 12, they can embark on a quest to acquire one of these mystical gems. It can be a quest searching a long since untouched mountaintop where their stone is calling to them? Perhaps instead it's an old family heirloom, already bonded to your bloodline? Maybe it's the mega stone of a nemesis who was recently slain, leaving the stone masterless and to your mercy. The reason for your acquisition can be many but cannot be effortless. A legendary item is in need of a legendary trial to acquire such power.\n\nMega Evolution creation is a more involved process than most things on the server, needing the player and admins to work together to make sure everything is set correctly. The requirements for being eligible are having your character at level 12 and using their final evolution stats (exceptions can be made for certain pokemon that don't have much different between stages like Scyther). If you're interested in creating one, ask an admin to start the process, however this entry will continue detailing those steps as well.\n\n- Create the Mega form\n*Mega Evolution... is an evolution! The pokemon's appearance changes along with the gaining of new power.*\nOf course we don't expect art of the form if you don't have or want to, but a few details about it's change in appearance will help in making game statistics that match.\n- Build it's stats\n*Mega Evolution brings an increase of power that puts even the strongest or fastest mons to shame.* \nYou have 7 points available to allocate to your species's original stat block, each one raising the maximum attribute you put it in by 1. The maximum you can raise a stat normally is to 10, but once an attribute has reached 10, you can use the usual limit break rules to raise it to the cap of 11. Besides the 7 extra points you can apply, you can also optionally move 3 existing points wherever you want.\n- Change or add a secondary type (optional)\n*With a new form comes the possibility of new affinities.*\nIf you so desire, you can change or add your secondary type to one of your choice (recommended to match appearance to fit better thematically). You cannot change your primary type.\n- Find a fitting Ability (optional)\n*Has a new trait or skill popped up with this evolution?*\nYou can choose to just use your species's usual ability or one of the many abilities available in pokemon, as long as it makes sense to your new form of course. If you're looking for something more personalized, you can get the permission of a completely unique ability, however the admin team needs to give the final OK for that.\n- Create the quest\n*No power comes to one for free. What journey will your character go on to acquire this ability so many can only dream of gaining?*\nWith your Mega form created, all that's left is working with a GM that agrees to create a quest appropriate for gaining your stone. This cannot just be a simple \"go and grab the item\" quest. Work with the GM to make something that puts your character through a true hardship, something to show they've earned the right to a Mega Stone.\n\nUntil mega evolutions are properly supported by the bot, use this template when posting your mega-sheet:\n## Mega Form\n**Type:** <Your Type Emojis>\n```\nHP: 2\nWillpower: 2\n\nStrength:  1 |⬤⭘\nDexterity: 1 |⬤⭘\nVitality:  1 |⬤⭘\nSpecial:   1 |⬤⭘\nInsight:   1 |⬤⭘\n\nDefense: 0\nSpecial Defense: 0\nActive Move Limit: 3\n```\n### Ability\n<Your Ability>\n\n__Dots__ (just delete this after you're done)\n⭘ No points\n⬤ Point invested \n⧳ Limit break",
  "example": "A Cleffa using Clefable stats has just reached level 12 and is interested in using Mega Evolution. They're taking the visual of Cleffa looking like a star somewhat literally and having their form be based on the wishing on a star saying, making them glow and almost float off the floor, using metronome to wish for a solution to their problems. This is something that heavily changes them from a support with high insight investment for move slots into a split attacker, hoping metronome hits hard every turn. This has been translated via putting all 7 points into Strength and Special as well as moving 1 point from Vitality and Insight to cap them off at full 10s. To hammer home the chaotic nature of this form they've chosen Protean to change along with every wish of metronome.\n\n__Clefable Stats__\n**Type**: Fairy\n**Base HP**: 5\n**Strength**: ⬤⬤⬤⭘⭘⭘ `3/6`\n**Dexterity**: ⬤⬤⭘⭘⭘ `2/5`\n**Vitality**: ⬤⬤⭘⭘⭘ `2/5`\n**Special**: ⬤⬤⬤⭘⭘⭘ `3/6`\n**Insight**: ⬤⬤⬤⭘⭘⭘ `3/6`\n**Ability**: Cute Charm / Magic Guard (Unaware)\n\n__Mega Cleffa Stats__\n**Type**: Fairy/Psychic \n**Base HP**: 5\n**Strength**: ⬤⬤⬤⬤⬤⭘⭘⭘⭘⭘ `5/10`\n**Dexterity**: ⬤⬤⭘⭘ `2/4`\n**Vitality**: ⬤⬤⭘⭘ `2/4`\n**Special**: ⬤⬤⬤⬤⬤⭘⭘⭘⭘⭘ `5/10`\n**Insight**: ⬤⬤⭘⭘ `2/4`\n**Ability**: Protean"
}
